Join the data from Part 1 with the data from Part 2 to create a new dataframe.

In [21]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline     
sns.set(color_codes=True)
# import requests
import datetime as dt
import calendar

In [22]:
# Import data from file
df_ctybks = pd.read_csv('data/df_citybikes.csv')
df_fsq = pd.read_csv('data/df_fsq0.csv')
df_yelp = pd.read_csv('data/df_yelp0.csv')

In [23]:
print(df_ctybks.shape)
print(df_fsq.shape)

(241, 10)
(2410, 15)

Provide a visualization that you used as part of your EDA process. Explain the initial pattern or relationship you discoved through this visualization.

In [24]:
# Create a new column with the coordinate data we need, reformated to str dtype.

# Grab just the two columns we need lat and lon
df_ctybks.dropna(subset=['latitude', 'longitude'], inplace=True)

# Creation of a new variable with lon and lat together, label the column header 'lat-long'
df_ctybks['lat-long'] = df_ctybks['latitude'].astype(str) + ',' + df_ctybks['longitude'].astype(str)
df_ctybks = df_ctybks[df_ctybks['lat-long'] != '0.0,0.0']
df_ctybks.head()

,Station Name,slots,empty_slots,free_bikes,status,bank_card,latitude,longitude,timestamp,Unique ID,lat-long
0,0001 10th & Cambie,35,16,19,online,No,49.262487,-123.114397,2022-11-07T17:29:02.108000Z,1,"49.262487,-123.114397"
1,0004 Yaletown-Roundhouse Station,16,2,14,online,No,49.274566,-123.121817,2022-11-07T17:29:02.153000Z,4,"49.274566,-123.121817"
2,0005 Dunsmuir & Beatty,26,8,18,online,No,49.279764,-123.110154,2022-11-07T17:29:02.161000Z,5,"49.279764,-123.110154"
3,0007 12th & Yukon (City Hall),16,11,5,online,No,49.260599,-123.113504,2022-11-07T17:29:02.189000Z,7,"49.260599,-123.113504"
4,0008 8th & Ash,16,7,9,online,No,49.264215,-123.117772,2022-11-07T17:29:02.194000Z,8,"49.264215,-123.117772"

In [25]:
# Split the Station id number from the list of station names:
st_id = df_ctybks['Station Name']
id_nums = []
st_names = []
for id in st_id:
    if id[:4].isnumeric():
        id_num = id[:4]
        st_name = id[4:]
    elif id[:3].isnumeric():
        id_num = id[:3]
        st_name = id[:3]
    else: None
    num = int(id_num)

    st_names.append(st_name)
    id_nums.append(num)

# Confirm total 241 values:
print(len(id_nums))
print(len(st_names))
# Confirm type change to int
print(type(id_nums[0]))
print(type(st_names[0]))
# Check if the ids are unique
print(len(id_nums)==len(set(id_nums)))
print(len(st_names)==len(set(st_names)))
# Display a sample
print(id_nums[:14])
print(st_names[:14])

241
241
<class 'int'>
<class 'str'>
True
True
[1, 4, 5, 7, 8, 9, 10, 11, 14, 15, 16, 17, 19, 21]
[' 10th & Cambie', ' Yaletown-Roundhouse Station', ' Dunsmuir & Beatty', ' 12th & Yukon (City Hall)', ' 8th & Ash', ' Spyglass & Seawall', ' Stamps Landing', ' Ontario & Seawall', ' Canada Place', ' Granville & Georgia', ' Pender & Burrard', ' Marinaside & Davie', ' Robson & Hornby', ' Cordova & Granville']

In [26]:
# Add the new columns into the dataframe and confirm their addition
df_ctybks.insert(1, 'st_id', id_nums, False)
df_ctybks.insert(2, 'station_name', st_names, False)
df_ctybks.head(5)

,Station Name,st_id,station_name,slots,empty_slots,free_bikes,status,bank_card,latitude,longitude,timestamp,Unique ID,lat-long
0,0001 10th & Cambie,1,10th & Cambie,35,16,19,online,No,49.262487,-123.114397,2022-11-07T17:29:02.108000Z,1,"49.262487,-123.114397"
1,0004 Yaletown-Roundhouse Station,4,Yaletown-Roundhouse Station,16,2,14,online,No,49.274566,-123.121817,2022-11-07T17:29:02.153000Z,4,"49.274566,-123.121817"
2,0005 Dunsmuir & Beatty,5,Dunsmuir & Beatty,26,8,18,online,No,49.279764,-123.110154,2022-11-07T17:29:02.161000Z,5,"49.279764,-123.110154"
3,0007 12th & Yukon (City Hall),7,12th & Yukon (City Hall),16,11,5,online,No,49.260599,-123.113504,2022-11-07T17:29:02.189000Z,7,"49.260599,-123.113504"
4,0008 8th & Ash,8,8th & Ash,16,7,9,online,No,49.264215,-123.117772,2022-11-07T17:29:02.194000Z,8,"49.264215,-123.117772"

In [27]:
# Remove old station name column
df_ctybks = df_ctybks.drop(['Station Name'], axis = 1)
df_ctybks.head()

,st_id,station_name,slots,empty_slots,free_bikes,status,bank_card,latitude,longitude,timestamp,Unique ID,lat-long
0,1,10th & Cambie,35,16,19,online,No,49.262487,-123.114397,2022-11-07T17:29:02.108000Z,1,"49.262487,-123.114397"
1,4,Yaletown-Roundhouse Station,16,2,14,online,No,49.274566,-123.121817,2022-11-07T17:29:02.153000Z,4,"49.274566,-123.121817"
2,5,Dunsmuir & Beatty,26,8,18,online,No,49.279764,-123.110154,2022-11-07T17:29:02.161000Z,5,"49.279764,-123.110154"
3,7,12th & Yukon (City Hall),16,11,5,online,No,49.260599,-123.113504,2022-11-07T17:29:02.189000Z,7,"49.260599,-123.113504"
4,8,8th & Ash,16,7,9,online,No,49.264215,-123.117772,2022-11-07T17:29:02.194000Z,8,"49.264215,-123.117772"

In [28]:
df_ctybks.tail()

,st_id,station_name,slots,empty_slots,free_bikes,status,bank_card,latitude,longitude,timestamp,Unique ID,lat-long
236,516,Heather & 29th,22,21,1,online,No,49.245535,-123.120496,2022-11-07T17:29:02.666000Z,516,"49.245535,-123.120496"
237,41,Cardero & Robson,26,11,15,online,No,49.289255,-123.132677,2022-11-07T17:29:02.339000Z,41,"49.289255,-123.132677"
238,352,Commercial & 20th,18,10,8,online,No,49.252656,-123.067965,2022-11-07T17:29:02.642000Z,352,"49.252656,-123.067965"
239,196,Hornby & Drake,24,20,4,online,No,49.277527,-123.129464,2022-11-07T17:29:02.537000Z,196,"49.277527,-123.129464"
240,210,210,18,11,7,online,No,49.259469,-123.145718,2022-11-07T17:29:02.675000Z,210,"49.259469,-123.145718"

In [29]:
# Before merging, the lat & long columns can become confusing, so rename them first
df_ctybks = df_ctybks.rename(columns = {'latitude':'st_lat', 'longitude':'st_long', 'free_bikes': 'available'})
df_ctybks.head(3)

,st_id,station_name,slots,empty_slots,available,status,bank_card,st_lat,st_long,timestamp,Unique ID,lat-long
0,1,10th & Cambie,35,16,19,online,No,49.262487,-123.114397,2022-11-07T17:29:02.108000Z,1,"49.262487,-123.114397"
1,4,Yaletown-Roundhouse Station,16,2,14,online,No,49.274566,-123.121817,2022-11-07T17:29:02.153000Z,4,"49.274566,-123.121817"
2,5,Dunsmuir & Beatty,26,8,18,online,No,49.279764,-123.110154,2022-11-07T17:29:02.161000Z,5,"49.279764,-123.110154"

In [30]:
# # Before merging, the lat & long columns can become confusing, so remove them first
# df_ctybks = df_ctybks.drop(['latitude', 'longitude', 'Unique ID'], axis = 1)
# df_ctybks.head(5)

In [31]:
# Does 'bank_card' or 'status' provide any meaningful data?
print(df_ctybks['bank_card'].unique())
print(df_ctybks['status'].unique())

['No']
['online' 'offline']

In [32]:
# Removing 'bank_card' and 'Unique ID'
df_ctybks = df_ctybks.drop(['bank_card'], axis = 1)
df_ctybks.head(5)

,st_id,station_name,slots,empty_slots,available,status,st_lat,st_long,timestamp,Unique ID,lat-long
0,1,10th & Cambie,35,16,19,online,49.262487,-123.114397,2022-11-07T17:29:02.108000Z,1,"49.262487,-123.114397"
1,4,Yaletown-Roundhouse Station,16,2,14,online,49.274566,-123.121817,2022-11-07T17:29:02.153000Z,4,"49.274566,-123.121817"
2,5,Dunsmuir & Beatty,26,8,18,online,49.279764,-123.110154,2022-11-07T17:29:02.161000Z,5,"49.279764,-123.110154"
3,7,12th & Yukon (City Hall),16,11,5,online,49.260599,-123.113504,2022-11-07T17:29:02.189000Z,7,"49.260599,-123.113504"
4,8,8th & Ash,16,7,9,online,49.264215,-123.117772,2022-11-07T17:29:02.194000Z,8,"49.264215,-123.117772"

In [33]:
# Convert the string format to datetime object
df_ctybks['timestamp'] = pd.to_datetime(df_ctybks['timestamp'], format='%Y%m%d %H:%M')
# Remove time and hour values from timestamp and store in new columns
df_ctybks['date_cb'] = df_ctybks['timestamp'].dt.date
df_ctybks['hour_cb'] = df_ctybks['timestamp'].dt.hour
# Display the dataframe
df_ctybks.head()

,st_id,station_name,slots,empty_slots,available,status,st_lat,st_long,timestamp,Unique ID,lat-long,date_cb,hour_cb
0,1,10th & Cambie,35,16,19,online,49.262487,-123.114397,2022-11-07 17:29:02.108000+00:00,1,"49.262487,-123.114397",2022-11-07,17
1,4,Yaletown-Roundhouse Station,16,2,14,online,49.274566,-123.121817,2022-11-07 17:29:02.153000+00:00,4,"49.274566,-123.121817",2022-11-07,17
2,5,Dunsmuir & Beatty,26,8,18,online,49.279764,-123.110154,2022-11-07 17:29:02.161000+00:00,5,"49.279764,-123.110154",2022-11-07,17
3,7,12th & Yukon (City Hall),16,11,5,online,49.260599,-123.113504,2022-11-07 17:29:02.189000+00:00,7,"49.260599,-123.113504",2022-11-07,17
4,8,8th & Ash,16,7,9,online,49.264215,-123.117772,2022-11-07 17:29:02.194000+00:00,8,"49.264215,-123.117772",2022-11-07,17

In [34]:
# Confirm the datetime object data change
df_ctybks.dtypes

st_id                         int64
station_name                 object
slots                         int64
empty_slots                   int64
available                     int64
status                       object
st_lat                      float64
st_long                     float64
timestamp       datetime64[ns, UTC]
Unique ID                     int64
lat-long                     object
date_cb                      object
hour_cb                       int64
dtype: object

In [35]:
print(df_fsq.dtypes)
df_fsq.head(3)

lat-long          object
fsq_id            object
cat_id           float64
category_name     object
categories        object
name              object
distance           int64
latitude         float64
longitude        float64
address           object
popularity       float64
price            float64
open_now            bool
rating           float64
rating_count     float64
dtype: object

,lat-long,fsq_id,cat_id,category_name,categories,name,distance,latitude,longitude,address,popularity,price,open_now,rating,rating_count
0,"49.262487,-123.114397",4fd3a01be4b0540d9cb027ea,13034.0,Café,"[{'id': 13034, 'name': 'Café', 'icon': {'prefi...",Moii Cafe,57,49.262562,-123.115171,"2559 Cambie St (btwn W Broadway & W 10th Ave),...",0.221702,1.0,True,8.0,55.0
1,"49.262487,-123.114397",4b1db335f964a520211424e3,13034.0,Café,"[{'id': 13034, 'name': 'Café', 'icon': {'prefi...",Marulilu Cafe,96,49.263364,-123.113942,"451W Broadway W (at Cambie St), Vancouver BC V...",0.953849,2.0,True,8.2,111.0
2,"49.262487,-123.114397",4db0b65d4df03036e8c0960c,11064.0,Hair Salon,"[{'id': 11064, 'name': 'Hair Salon', 'icon': {...",Space Salon,128,49.263102,-123.115785,"530W Broadway W (btw Ash & Cambie), Vancouver ...",0.785993,NaN,False,8.3,12.0

In [36]:
print(df_yelp.dtypes)

lat-long          object
category_name     object
categories        object
name              object
distance         float64
latitude         float64
longitude        float64
address           object
price             object
is_closed           bool
rating           float64
rating_count       int64
dtype: object

now for the foursquare dataframe:

In [37]:
print(df_fsq.shape)
print(df_yelp.shape)
print(df_ctybks.shape)

(2410, 15)
(4788, 12)
(241, 13)

In [38]:
df_merged = pd.merge(df_ctybks, df_fsq, how='inner', on='lat-long')
print(df_merged.shape)
df_merged.head(2)

(2410, 27)

,st_id,station_name,slots,empty_slots,available,status,st_lat,st_long,timestamp,Unique ID,...,name,distance,latitude,longitude,address,popularity,price,open_now,rating,rating_count
0,1,10th & Cambie,35,16,19,online,49.262487,-123.114397,2022-11-07 17:29:02.108000+00:00,1,...,Moii Cafe,57,49.262562,-123.115171,"2559 Cambie St (btwn W Broadway & W 10th Ave),...",0.221702,1.0,True,8.0,55.0
1,1,10th & Cambie,35,16,19,online,49.262487,-123.114397,2022-11-07 17:29:02.108000+00:00,1,...,Marulilu Cafe,96,49.263364,-123.113942,"451W Broadway W (at Cambie St), Vancouver BC V...",0.953849,2.0,True,8.2,111.0

In [39]:
# Checking the types of data
df = df_merged.copy()
df.dtypes

st_id                          int64
station_name                  object
slots                          int64
empty_slots                    int64
available                      int64
status                        object
st_lat                       float64
st_long                      float64
timestamp        datetime64[ns, UTC]
Unique ID                      int64
lat-long                      object
date_cb                       object
hour_cb                        int64
fsq_id                        object
cat_id                       float64
category_name                 object
categories                    object
name                          object
distance                       int64
latitude                     float64
longitude                    float64
address                       object
popularity                   float64
price                        float64
open_now                        bool
rating                       float64
rating_count                 float64
dtype: object

In [40]:
# Create the New Tables

# Bike users table: 
'''
potentially relevant data for a citybik.es user, accessing data for 
or at any particular location of a citybik.es station
'''
Citybikes_users = df[[
    'st_id'
    , 'station_name'
    , 'slots'
    , 'empty_slots'
    , 'available'
    , 'status'
    , 'st_lat'
    , 'st_long'
    , 'timestamp'
    , 'date_cb'
    , 'hour_cb'
    , 'fsq_id'
]]

'''
data for all citybik.es time relevant uses and connections
'''
Citybikes_datetime = df[[
    'st_id'
     , 'station_name'
     , 'fsq_id'
     , 'timestamp'
     , 'date_cb'
     , 'hour_cb'
     ]]

'''
data for all citybik.es users to overview POI options, distances, map location pins
'''
POI_for_users = df[[
    'st_id'
    , 'station_name'
    , 'fsq_id'
    , 'cat_id'
    , 'category_name'
    , 'name'
    , 'distance'
    , 'latitude'
    , 'longitude'
    , 'open_now'
    ]]

'''
community sourced data for all citybik.es users
'''
Media = df[[
    'st_id'
    , 'station_name'
    , 'fsq_id'
    , 'cat_id'
    , 'category_name'
    , 'name'
    , 'popularity'
    , 'price'
    , 'rating'
    , 'rating_count'
    , 'distance'
    , 'latitude'
    , 'longitude'
    , 'open_now'
    ]]

'''
All additional business details including physical address and contact information
'''
Business = df[[
    'st_id'
     , 'station_name'
     , 'fsq_id'
     , 'cat_id'
     , 'category_name'
     , 'categories'
     , 'name'
     , 'address'
     , 'distance'
     , 'latitude'
     , 'longitude'
     , 'open_now'
     ]]

In [41]:
Citybikes_users.head(3)

,st_id,station_name,slots,empty_slots,available,status,st_lat,st_long,timestamp,date_cb,hour_cb,fsq_id
0,1,10th & Cambie,35,16,19,online,49.262487,-123.114397,2022-11-07 17:29:02.108000+00:00,2022-11-07,17,4fd3a01be4b0540d9cb027ea
1,1,10th & Cambie,35,16,19,online,49.262487,-123.114397,2022-11-07 17:29:02.108000+00:00,2022-11-07,17,4b1db335f964a520211424e3
2,1,10th & Cambie,35,16,19,online,49.262487,-123.114397,2022-11-07 17:29:02.108000+00:00,2022-11-07,17,4db0b65d4df03036e8c0960c

In [42]:
Citybikes_datetime.head(3)

,st_id,station_name,fsq_id,timestamp,date_cb,hour_cb
0,1,10th & Cambie,4fd3a01be4b0540d9cb027ea,2022-11-07 17:29:02.108000+00:00,2022-11-07,17
1,1,10th & Cambie,4b1db335f964a520211424e3,2022-11-07 17:29:02.108000+00:00,2022-11-07,17
2,1,10th & Cambie,4db0b65d4df03036e8c0960c,2022-11-07 17:29:02.108000+00:00,2022-11-07,17

In [43]:
POI_for_users.head(3)

,st_id,station_name,fsq_id,cat_id,category_name,name,distance,latitude,longitude,open_now
0,1,10th & Cambie,4fd3a01be4b0540d9cb027ea,13034.0,Café,Moii Cafe,57,49.262562,-123.115171,True
1,1,10th & Cambie,4b1db335f964a520211424e3,13034.0,Café,Marulilu Cafe,96,49.263364,-123.113942,True
2,1,10th & Cambie,4db0b65d4df03036e8c0960c,11064.0,Hair Salon,Space Salon,128,49.263102,-123.115785,False

In [44]:
Media.head(3)

,st_id,station_name,fsq_id,cat_id,category_name,name,popularity,price,rating,rating_count,distance,latitude,longitude,open_now
0,1,10th & Cambie,4fd3a01be4b0540d9cb027ea,13034.0,Café,Moii Cafe,0.221702,1.0,8.0,55.0,57,49.262562,-123.115171,True
1,1,10th & Cambie,4b1db335f964a520211424e3,13034.0,Café,Marulilu Cafe,0.953849,2.0,8.2,111.0,96,49.263364,-123.113942,True
2,1,10th & Cambie,4db0b65d4df03036e8c0960c,11064.0,Hair Salon,Space Salon,0.785993,NaN,8.3,12.0,128,49.263102,-123.115785,False

In [45]:
Business.head(1)

,st_id,station_name,fsq_id,cat_id,category_name,categories,name,address,distance,latitude,longitude,open_now
0,1,10th & Cambie,4fd3a01be4b0540d9cb027ea,13034.0,Café,"[{'id': 13034, 'name': 'Café', 'icon': {'prefi...",Moii Cafe,"2559 Cambie St (btwn W Broadway & W 10th Ave),...",57,49.262562,-123.115171,True

In [46]:
# Prep df (copy of df_merged) for model building
df.head(1)

,st_id,station_name,slots,empty_slots,available,status,st_lat,st_long,timestamp,Unique ID,...,name,distance,latitude,longitude,address,popularity,price,open_now,rating,rating_count
0,1,10th & Cambie,35,16,19,online,49.262487,-123.114397,2022-11-07 17:29:02.108000+00:00,1,...,Moii Cafe,57,49.262562,-123.115171,"2559 Cambie St (btwn W Broadway & W 10th Ave),...",0.221702,1.0,True,8.0,55.0

In [47]:
# Dropping irrelevant columns
df = df.drop(['station_name', 'lat-long', 'address', 'st_lat', 'st_long', 'latitude', 'longitude'], axis=1)
df.head(3)

,st_id,slots,empty_slots,available,status,timestamp,Unique ID,date_cb,hour_cb,fsq_id,cat_id,category_name,categories,name,distance,popularity,price,open_now,rating,rating_count
0,1,35,16,19,online,2022-11-07 17:29:02.108000+00:00,1,2022-11-07,17,4fd3a01be4b0540d9cb027ea,13034.0,Café,"[{'id': 13034, 'name': 'Café', 'icon': {'prefi...",Moii Cafe,57,0.221702,1.0,True,8.0,55.0
1,1,35,16,19,online,2022-11-07 17:29:02.108000+00:00,1,2022-11-07,17,4b1db335f964a520211424e3,13034.0,Café,"[{'id': 13034, 'name': 'Café', 'icon': {'prefi...",Marulilu Cafe,96,0.953849,2.0,True,8.2,111.0
2,1,35,16,19,online,2022-11-07 17:29:02.108000+00:00,1,2022-11-07,17,4db0b65d4df03036e8c0960c,11064.0,Hair Salon,"[{'id': 11064, 'name': 'Hair Salon', 'icon': {...",Space Salon,128,0.785993,NaN,False,8.3,12.0

In [48]:
# Dropping irrelevant columns
df = df.drop(['timestamp', 'categories'], axis=1)
df.head(3)

,st_id,slots,empty_slots,available,status,Unique ID,date_cb,hour_cb,fsq_id,cat_id,category_name,name,distance,popularity,price,open_now,rating,rating_count
0,1,35,16,19,online,1,2022-11-07,17,4fd3a01be4b0540d9cb027ea,13034.0,Café,Moii Cafe,57,0.221702,1.0,True,8.0,55.0
1,1,35,16,19,online,1,2022-11-07,17,4b1db335f964a520211424e3,13034.0,Café,Marulilu Cafe,96,0.953849,2.0,True,8.2,111.0
2,1,35,16,19,online,1,2022-11-07,17,4db0b65d4df03036e8c0960c,11064.0,Hair Salon,Space Salon,128,0.785993,NaN,False,8.3,12.0

In [49]:
# Dropping irrelevant columns
df = df.drop(['fsq_id', 'date_cb', 'name','category_name'], axis=1)
df.head(3)

,st_id,slots,empty_slots,available,status,Unique ID,hour_cb,cat_id,distance,popularity,price,open_now,rating,rating_count
0,1,35,16,19,online,1,17,13034.0,57,0.221702,1.0,True,8.0,55.0
1,1,35,16,19,online,1,17,13034.0,96,0.953849,2.0,True,8.2,111.0
2,1,35,16,19,online,1,17,11064.0,128,0.785993,NaN,False,8.3,12.0

In [50]:
#renaming the columns if needed - say if you wanted them "short and pithy Dr B!"
df = df.rename(columns = {'empty_slots':'empty', 'hour_cb':'time_of_query'})
df.head(3)

,st_id,slots,empty,available,status,Unique ID,time_of_query,cat_id,distance,popularity,price,open_now,rating,rating_count
0,1,35,16,19,online,1,17,13034.0,57,0.221702,1.0,True,8.0,55.0
1,1,35,16,19,online,1,17,13034.0,96,0.953849,2.0,True,8.2,111.0
2,1,35,16,19,online,1,17,11064.0,128,0.785993,NaN,False,8.3,12.0

In [51]:

# Check for null values
df.count()

st_id            2410
slots            2410
empty            2410
available        2410
status           2410
Unique ID        2410
time_of_query    2410
cat_id           2406
distance         2410
popularity       2409
price            1494
open_now         2410
rating           2260
rating_count     2260
dtype: int64

In [52]:
# Price, rating and rating _count null values can be changed to 0:
df[['price', 'rating', 'rating_count']] = df[['price', 'rating', 'rating_count']].replace(np.nan, 0)
print(df.shape)
df.count()

(2410, 14)

st_id            2410
slots            2410
empty            2410
available        2410
status           2410
Unique ID        2410
time_of_query    2410
cat_id           2406
distance         2410
popularity       2409
price            2410
open_now         2410
rating           2410
rating_count     2410
dtype: int64

In [53]:
# The remaining null values can be dropped
df = df.dropna()
print(df.shape)
df.count()

(2405, 14)

st_id            2405
slots            2405
empty            2405
available        2405
status           2405
Unique ID        2405
time_of_query    2405
cat_id           2405
distance         2405
popularity       2405
price            2405
open_now         2405
rating           2405
rating_count     2405
dtype: int64

In [54]:
# Now convert 'status' to numerical boolean values
df[['status']] = df[['status']].replace('online', 1)
df[['status']] = df[['status']].replace('offline', 0)
df['status'].unique()

array([1, 0])

In [55]:
# Now convert 'open_now' to numerical boolean values
df[['open_now']] = df[['open_now']].replace(True, 1)
# df[['open_now']] = df[['open_now']].replace(False, np.nan)
df[['open_now']] = df[['open_now']].replace(False, 0)
# print(df.count())
print(df['open_now'].unique())
# df['open_now'].sum()

[1 0]

In [56]:
# Recheck headings:
df.dtypes

st_id              int64
slots              int64
empty              int64
available          int64
status             int64
Unique ID          int64
time_of_query      int64
cat_id           float64
distance           int64
popularity       float64
price            float64
open_now           int64
rating           float64
rating_count     float64
dtype: object

In [57]:
save_num_df = 0

df.to_csv(f'data/df{save_num_df}.csv', index=False)
save_num_df += 1

In [58]:
# Save tables to data file

# Move these to top of doc so they're only run once, in order to activate sequential save values/files
save_num_df_merged = 0
save_num_df_fsq = 1
save_num_df_yelp = 1
save_num_df_ctybks = 0
save_num_Business = 0
save_num_Citybikes_datetime = 0
save_num_Citybikes_users = 0
save_num_Media = 0
save_num_POI_for_users = 0

df_merged.to_csv(f'data/SQLite/stp2_df_merged{save_num_df_merged}.csv', index=False)
save_num_df_merged += 1

df_fsq.to_csv(f'data/stp2_df_fsq{save_num_df_fsq}.csv', index=False)
save_num_df_fsq += 1

df_yelp.to_csv(f'data/stp2_df_yelp{save_num_df_yelp}.csv', index=False)
save_num_df_yelp += 1

df_ctybks.to_csv(f'data/stp2_df_ctybks{save_num_df_ctybks}.csv', index=False)
save_num_df_ctybks += 1

Business.to_csv(f'data/SQLite/stp2_Business{save_num_Business}.csv', index=False)
save_num_Business += 1

Citybikes_datetime.to_csv(f'data/SQLite/stp2_Citybikes_datetime{save_num_Citybikes_datetime}.csv', index=False)
save_num_Citybikes_datetime += 1

Citybikes_users.to_csv(f'data/SQLite/stp2_Citybikes_users{save_num_Citybikes_users}.csv', index=False)
save_num_Citybikes_users += 1

Media.to_csv(f'data/SQLite/stp2_Media{save_num_Media}.csv', index=False)
save_num_Media += 1

POI_for_users.to_csv(f'data/SQLite/stp2_POI_for_users{save_num_POI_for_users}.csv', index=False)
save_num_POI_for_users += 1

In [ ]:
# Visualization things

In [ ]:
# SQLite DB creation

In [ ]:
# An example of groupby:
# df.groupby(df.server_id).resample('M')['cpu_utilization', 'free_memory'].max()

In [ ]:
# Renaming the columns if needed - say if you wanted them "short and pithy Dr B!"
# df = df.rename(columns = { 'Lengthy_current':'LP', 'doggy_booty_toot':'Lucy_etc.' })
# df.head(5)

In [ ]:
# Checking for the presence and location of duplicate rows
# duplicate_rows_df = df[df.duplicated()]

# And compare the difference in the DF shape:
# print(df.shape)
# print("number of duplicate rows: ", duplicate_rows_df.shape)

In [ ]:
# Assess the location and content of the duplications, are they appropriate?
# If not, we can drop them:

# First a count of the total rows to compare to #of duplicate rows
# df.count()

# Then we drop, and recheck:
# df = df.drop_duplicates()
# df.head(5)

In [ ]:
# Drop any missing or null values:
# print(df.isnull().sum())

In [ ]:
# We'll drop the full rows that contain null values:
# df = dfdropna()
# df.count()

In [ ]:
# Validating the dropped missing values
# print(df.isnull().sum())

In [ ]:
# Detecting outliers on numerical values
# sns.boxplot(x=df['col_with_numerical_value'])

# Database

Put all your results in an SQLite3 database (remember, SQLite stores its databases as files in your local machine - make sure to create your database in your project's data/ directory!)

In [ ]:
# Jamie's reuseable library of database functions

# NOTE: Using SQLite in this example, but can follow a similar workflow to connect 
# to any other database when we have the correct Python library:
# `mysql-connector-python` for MySQL
# `psycopg2` for Postgres
# `SQLAlchemy` - generic library which using JDBC to connect to different DBs
import sqlite3
from sqlite3 import Error

def create_connection(path):
    connection = None
    try:
        connection = sqlite3.connect(path)
        print("Connection to SQLite DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")
    
    return connection

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

def execute_read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as e:
        print(f"The error '{e}' occurred")

# WIP --------------------------

In [ ]:
# SQL Queries

# Queries to start setting up our database 
# schema (tables and relationships)
create_citybikes_users_table = """
CREATE TABLE IF NOT EXISTS citybikes_users (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
);
"""

# create_???_table = """
# CREATE TABLE IF NOT EXISTS ??? (
#   id INTEGER PRIMARY KEY AUTOINCREMENT,
# );
# """

# create_???_table = """
# CREATE TABLE IF NOT EXISTS ??? (
#   id INTEGER PRIMARY KEY AUTOINCREMENT,
# );
# """

# create_???_table = """
# CREATE TABLE IF NOT EXISTS ??? (
#   id INTEGER PRIMARY KEY AUTOINCREMENT,
# );
# """

# create_???_table = """
# CREATE TABLE IF NOT EXISTS ??? (
#   id INTEGER PRIMARY KEY AUTOINCREMENT,
# );
# """

In [ ]:
# Setting up the application database schema

# Connect to an existing database, or create a 
# new one if it doesn't exist
# connection = create_connection("???.sqlite")

# Create DB tables
# NOTE: Running these queries multiple times will
# not effect the tables due to "IF EXISTS"
# DUPLICATION PROTECTION
# execute_query(connection, create_citybikes_users_table) 
# execute_query(connection, create_???_table) 
# execute_query(connection, create_???_table) 
# execute_query(connection, create_???_table)
# execute_query(connection, create_???_table)

In [ ]:
# Insert seed data
# NOTE: Running these queries multiple times will
# generate duplicate data into the database
# NO DUPLICATION PROTECTION
# execute_query(connection, create_???)
# execute_query(connection, create_???)
# execute_query(connection, create_???)
# execute_query(connection, create_???)
# execute_query(connection, create_???)

Look at the data before and after the join to validate your data.